using BookWiki.Core.Files.PathModels;

namespace BookWiki.Core
{
    public class FakeNovel : INovel
    {
        private string _text = @"Сказки миров Сущего

Рога, копыта да хвосты
Давно это было, никто и не помнит, когда точно, но сказывали старики, что пугать их пытались злые силы демонюкские, а ничего не выходило. Почему? Да потому, что не было у них ни рогов, ни копыт, да и не злые они были, больше просто пакостники. Вылазит чёрт, а у него головешка лысая, блестит, солнце отражает, и все думают, что за жирдяй появился. И кричать начинают: «Жиробас выпил весь квас!». Чёрту обидно становилось и он назад возвращался, к себе в Ксерот.
И жили бы они так жили, если бы однажды чёрт не поспорил с дедом.
Говорит чёрт:
- Дед, а дед, а давай ты мне коров, быков да коз своих всё время отдавать будешь, а я тебя за это научу зверей ворожбой отваживать.
- А давай, - отвечает дед.
- Что, правда? Так просто? – удивился чёрт и почесал лысину.
- Да, так просто. Только что мои детки кушать будут? Не поедят детки и помрут, кто тебе скотину растить-то будет?
Почесал снова лысину чёрт и отвечает:
- Ладно, мясо себе забирай, мне не надо. А остальное чтоб отдал!
- Хорошо, но только вот беда такая, зимой холодно, нужно во что-то укрываться. Можно я себе и шкуры оставлю?
Подумал-подумал чёрт, посмотрел на деда, думает да, это ж у него в Ксероте всегда жарко, а тут холодно даже летом. Подохнет со всеми родственниками, кто ему дань платить будет?
- Оставляй, - махнул рукой чёрт.
- А можно ещё кишки на колбаски, тебе-то от них какой толк? – спросил дед.
А действительно, толку от этих кишек.
- И косточки курочкам. Кости тебе-то зачем? Ты ж их и не разгрызёшь-то…
- Да, не разгрызу, - согласился чёрт и потрогал гнилые зубы.
- Но так-то вся скотина: и козы, и коровы, и быки, и даже бараны, всё твоё, - согласился дед.
Обрадовался чёрт, отдал деду охранные чары и пошёл к себе восвояси и стал дожидаться обещанного. Ждал он ждал, а тут раз и ему на голову рога да копыта с хвостами полетели. Вот, думает, сейчас говядинки отведаю, а тут вдруг нет её, одни копыта летят да рога.
Разозлился чёрт, закричал, ногами затопал, а к ним копыта и прилипли, а на голову рога упали, да так больно, что он прям сел, да прямо на хвост. А хвост взял и приклеился. Тянул чёрт тянул, за рога тянул, за хвост тянул, копыта оторвать пытался, а не может – приросло всё.
Пошёл он к деду, кричит, рогами размахивает, копытами топает. Перед ним честной народ разбегается, по дворам прячется. Дошёл он до дома дедова, кричит, а войти через калитку не может – чары мешают. Стукнул он кулаком раз, другой и обиженный так и ушёл к себе.
С тех пор демоны ходят злые, рогатые и хвостатые.
";

        private PathFake _source = new PathFake("1");

        public string Title { get; } = "Сказки миров Сущего";

        public IRelativePath Source => _source;

        public IText Content { get; }

        public ISequence<ITextInfo> Format { get; }

        public IText Comments { get; }

        public FakeNovel()
        {
            Content = new StringText(_text);
            Format = new ArraySequence<ITextInfo>(new []
            {
                new TextInfo(Content.Substring(0, 20), TextStyle.Bold),
                new TextInfo(Content.Substring(0, 20), TextStyle.Centered),
                new TextInfo(Content.Substring(_text.IndexOf("Рога, копыта да хвосты"), "Рога, копыта да хвосты".Length+1), TextStyle.Bold),
                new TextInfo(Content.Substring(_text.IndexOf("Рога, копыта да хвосты"), "Рога, копыта да хвосты".Length+1), TextStyle.Centered),
            });
        }
    }
}